Revit 2024 API
NumericRevisionSettings.MinimumDigits Property
 Controls the minimum number of digits for a revision number.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public int MinimumDigits { get; set; }
Visual Basic
Public Property MinimumDigits As Integer
	Get
	Set
Visual C++
public:
property int MinimumDigits {
	int get ();
	void set (int value);
}
Remarks
 Use MinimumDigits to force the minimum number of digits for a revision number. Zeros will be added to the front of the revision number until the minimum number of digits is satisfied. For example, if MinimumDigits is 3, then 9 will be printed as 009 and 10 will be printed as 010. If MinimumDigits is 1, then no zeros are added to the front of the revision number. The default value for MinimumDigits is 1. Values less than 1 are not allowed.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for minimumDigits is not positive.
See Also
NumericRevisionSettings Class
Autodesk.Revit.DB Namespace